---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidInsertOrientation
source: html/8bd7e2cc-ffeb-be7c-c68b-ca58e9e5b1d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.InvalidInsertOrientation Property

The insert orientation is incompatible with the wall's cross-section.

## Syntax (C#)
```csharp
public static FailureDefinitionId InvalidInsertOrientation { get; }
```